// Метод forEch перебирання масиву, який використовується для заміни циклів for і for...of в роботі з колекцією даних.

const numbers = [5, 10, 15, 20, 25];

numbers.forEach( (number, index)=> {
   console.log(`Індекс ${index}, значення ${number}`);
 });

 //Метод map(callback) використовується для трансформації масиву. Він викликає колбек-функцію для кожного елемента вихідного масиву, а результат її роботи записує у новий масив, який і  буде результатом виконання методу. Map може витягнути властивості , оновити одне або багато свойств , або обновити масив з одним якимось userom старий масив не міняється

 const planets = [3, 3, 5, 6];
 const a = planets

const planetsInUpperCase = planets.map(planet => planet*2); // перебирає масив і повертає новий масив не міняючи старий але з числами помноженими на 2
console.log(planetsInUpperCase); 

const arrays = [
   {id:1 ,name:"sasha", age:32},
   {id:2 ,name:"olek", age:22},
   {id:3 ,name:"pasha", age:27},
]

const arrayMap = arrays.map(array=>{ // Онлвлення алемента 
   if(array.id===1){                 // шукаємо по id кого треба оновити 
      return {                      // як тільки знайшли воно розпилює старий обєкт а ставить і оновлює старе значення після цього продовжується ітерація
        ...array ,                  //розпилили старий обєкт 
         name :'Rus'              // {id:1 ,name:"Rud", age:32}, оноили поле name
      }
   }
   return array                     // тому потрібно повертати array воно оновило  на ітерації той обєкт який знайшло і повернуло всі інші
});
console.log(arrayMap);